Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMV71_DFP/2.4.171/samv71b/include/component/pio.h
/* -------- PIO_IFSCSR : (PIO Offset: 0x88) (R/ 32) Input Filter Slow Clock Status Register -------- */
#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
#if COMPONENT_TYPEDEF_STYLE == 'N'
typedef union { 
  struct {
    uint32_t P0:1;                      /**< bit:      0  Glitch or Debouncing Filter Selection Status */
    uint32_t P1:1;                      /**< bit:      1  Glitch or Debouncing Filter Selection Status */
    uint32_t P2:1;                      /**< bit:      2  Glitch or Debouncing Filter Selection Status */
    uint32_t P3:1;                      /**< bit:      3  Glitch or Debouncing Filter Selection Status */
    uint32_t P4:1;                      /**< bit:      4  Glitch or Debouncing Filter Selection Status */
    uint32_t P5:1;                      /**< bit:      5  Glitch or Debouncing Filter Selection Status */
    uint32_t P6:1;                      /**< bit:      6  Glitch or Debouncing Filter Selection Status */
    uint32_t P7:1;                      /**< bit:      7  Glitch or Debouncing Filter Selection Status */
    uint32_t P8:1;                      /**< bit:      8  Glitch or Debouncing Filter Selection Status */
    uint32_t P9:1;                      /**< bit:      9  Glitch or Debouncing Filter Selection Status */
    uint32_t P10:1;                     /**< bit:     10  Glitch or Debouncing Filter Selection Status */
    uint32_t P11:1;                     /**< bit:     11  Glitch or Debouncing Filter Selection Status */
    uint32_t P12:1;                     /**< bit:     12  Glitch or Debouncing Filter Selection Status */
    uint32_t P13:1;                     /**< bit:     13  Glitch or Debouncing Filter Selection Status */
    uint32_t P14:1;                     /**< bit:     14  Glitch or Debouncing Filter Selection Status */
    uint32_t P15:1;                     /**< bit:     15  Glitch or Debouncing Filter Selection Status */
    uint32_t P16:1;                     /**< bit:     16  Glitch or Debouncing Filter Selection Status */
    uint32_t P17:1;                     /**< bit:     17  Glitch or Debouncing Filter Selection Status */
    uint32_t P18:1;                     /**< bit:     18  Glitch or Debouncing Filter Selection Status */
    uint32_t P19:1;                     /**< bit:     19  Glitch or Debouncing Filter Selection Status */
    uint32_t P20:1;                     /**< bit:     20  Glitch or Debouncing Filter Selection Status */
    uint32_t P21:1;                     /**< bit:     21  Glitch or Debouncing Filter Selection Status */
    uint32_t P22:1;                     /**< bit:     22  Glitch or Debouncing Filter Selection Status */
    uint32_t P23:1;                     /**< bit:     23  Glitch or Debouncing Filter Selection Status */
    uint32_t P24:1;                     /**< bit:     24  Glitch or Debouncing Filter Selection Status */
    uint32_t P25:1;                     /**< bit:     25  Glitch or Debouncing Filter Selection Status */
    uint32_t P26:1;                     /**< bit:     26  Glitch or Debouncing Filter Selection Status */
    uint32_t P27:1;                     /**< bit:     27  Glitch or Debouncing Filter Selection Status */
    uint32_t P28:1;                     /**< bit:     28  Glitch or Debouncing Filter Selection Status */
    uint32_t P29:1;                     /**< bit:     29  Glitch or Debouncing Filter Selection Status */
    uint32_t P30:1;                     /**< bit:     30  Glitch or Debouncing Filter Selection Status */
    uint32_t P31:1;                     /**< bit:     31  Glitch or Debouncing Filter Selection Status */
  } bit;                                /**< Structure used for bit  access */
  struct {
    uint32_t P:32;                      /**< bit:  0..31  Glitch or Debouncing Filter Selection Status */
  } vec;                                /**< Structure used for vec  access  */
  uint32_t reg;                         /**< Type used for register access */
} PIO_IFSCSR_Type;
#endif
#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */

#define PIO_IFSCSR_OFFSET                   (0x88)                                        /**<  (PIO_IFSCSR) Input Filter Slow Clock Status Register  Offset */

#define PIO_IFSCSR_P0_Pos                   0                                              /**< (PIO_IFSCSR) Glitch or Debouncing Filter Selection Status Position */
#define PIO_IFSCSR_P0_Msk                   (_U_(0x1) << PIO_IFSCSR_P0_Pos)                /**< (PIO_IFSCSR) Glitch or Debouncing Filter Selection Status Mask */
#define PIO_IFSCSR_P0                       PIO_IFSCSR_P0_Msk                              /**< \deprecated Old style mask definition for 1 bit bitfield. Use PIO_IFSCSR_P0_Msk instead */
#define PIO_IFSCSR_P1_Pos                   1                                              /**< (PIO_IFSCSR) Glitch or Debouncing Filter Selection Status Position */
#define PIO_IFSCSR_P1_Msk                   (_U_(0x1) << PIO_IFSCSR_P1_Pos)                /**< (PIO_IFSCSR) Glitch or Debouncing Filter Selection Status Mask */
#define PIO_IFSCSR_P1                       PIO_IFSCSR_P1_Msk                              /**< \deprecated Old style mask definition for 1 bit bitfield. Use PIO_IFSCSR_P1_Msk instead */
#define PIO_IFSCSR_P2_Pos                   2                                              /**< (PIO_IFSCSR) Glitch or Debouncing Filter Selection Status Position */
#define PIO_IFSCSR_P2_Msk                   (_U_(0x1) << PIO_IFSCSR_P2_Pos)                /**< (PIO_IFSCSR) Glitch or Debouncing Filter Selection Status Mask */
#define PIO_IFSCSR_P2                       PIO_IFSCSR_P2_Msk                              /**< \deprecated Old style mask definition for 1 bit bitfield. Use PIO_IFSCSR_P2_Msk instead */
#define PIO_IFSCSR_P3_Pos                   3                                              /**< (PIO_IFSCSR) Glitch or Debouncing Filter Selection Status Position */
#define PIO_IFSCSR_P3_Msk                   (_U_(0x1) << PIO_IFSCSR_P3_Pos)                /**< (PIO_IFSCSR) Glitch or Debouncing Filter Selection Status Mask */
#define PIO_IFSCSR_P3                       PIO_IFSCSR_P3_Msk                              /**< \deprecated Old style mask definition for 1 bit bitfield. Use PIO_IFSCSR_P3_Msk instead */
#define PIO_IFSCSR_P4_Pos                   4                                              /**< (PIO_IFSCSR) Glitch or Debouncing Filter Selection Status Position */
#define PIO_IFSCSR_P4_Msk                   (_U_(0x1) << PIO_IFSCSR_P4_Pos)                /**< (PIO_IFSCSR) Glitch or Debouncing Filter Selection Status Mask */
#define PIO_IFSCSR_P4                       PIO_IFSCSR_P4_Msk                              /**< \deprecated Old style mask definition for 1 bit bitfield. Use PIO_IFSCSR_P4_Msk instead */
#define PIO_IFSCSR_P5_Pos                   5                                              /**< (PIO_IFSCSR) Glitch or Debouncing Filter Selection Status Position */
#define PIO_IFSCSR_P5_Msk                   (_U_(0x1) << PIO_IFSCSR_P5_Pos)                /**< (PIO_IFSCSR) Glitch or Debouncing Filter Selection Status Mask */
#define PIO_IFSCSR_P5                       PIO_IFSCSR_P5_Msk                              /**< \deprecated Old style mask definition for 1 bit bitfield. Use PIO_IFSCSR_P5_Msk instead */
#define PIO_IFSCSR_P6_Pos                   6                                              /**< (PIO_IFSCSR) Glitch or Debouncing Filter Selection Status Position */
#define PIO_IFSCSR_P6_Msk                   (_U_(0x1) << PIO_IFSCSR_P6_Pos)                /**< (PIO_IFSCSR) Glitch or Debouncing Filter Selection Status Mask */
#define PIO_IFSCSR_P6                       PIO_IFSCSR_P6_Msk                              /**< \deprecated Old style mask definition for 1 bit bitfield. Use PIO_IFSCSR_P6_Msk instead */
#define PIO_IFSCSR_P7_Pos                   7                                              /**< (PIO_IFSCSR) Glitch or Debouncing Filter Selection Status Position */
#define PIO_IFSCSR_P7_Msk                   (_U_(0x1) << PIO_IFSCSR_P7_Pos)                /**< (PIO_IFSCSR) Glitch or Debouncing Filter Selection Status Mask */
#define PIO_IFSCSR_P7                       PIO_IFSCSR_P7_Msk                              /**< \deprecated Old style mask definition for 1 bit bitfield. Use PIO_IFSCSR_P7_Msk instead */
#define PIO_IFSCSR_P8_Pos                   8                                              /**< (PIO_IFSCSR) Glitch or Debouncing Filter Selection Status Position */
#define PIO_IFSCSR_P8_Msk                   (_U_(0x1) << PIO_IFSCSR_P8_Pos)                /**< (PIO_IFSCSR) Glitch or Debouncing Filter Selection Status Mask */
#define PIO_IFSCSR_P8                       PIO_IFSCSR_P8_Msk                              /**< \deprecated Old style mask definition for 1 bit bitfield. Use PIO_IFSCSR_P8_Msk instead */
#define PIO_IFSCSR_P9_Pos                   9                                              /**< (PIO_IFSCSR) Glitch or Debouncing Filter Selection Status Position */
#define PIO_IFSCSR_P9_Msk                   (_U_(0x1) << PIO_IFSCSR_P9_Pos)                /**< (PIO_IFSCSR) Glitch or Debouncing Filter Selection Status Mask */
#define PIO_IFSCSR_P9                       PIO_IFSCSR_P9_Msk                              /**< \deprecated Old style mask definition for 1 bit bitfield. Use PIO_IFSCSR_P9_Msk instead */
#define PIO_IFSCSR_P10_Pos                  10                                             /**< (PIO_IFSCSR) Glitch or Debouncing Filter Selection Status Position */
#define PIO_IFSCSR_P10_Msk                  (_U_(0x1) << PIO_IFSCSR_P10_Pos)               /**< (PIO_IFSCSR) Glitch or Debouncing Filter Selection Status Mask */
#define PIO_IFSCSR_P10                      PIO_IFSCSR_P10_Msk                             /**< \deprecated Old style mask definition for 1 bit bitfield. Use PIO_IFSCSR_P10_Msk instead */
#define PIO_IFSCSR_P11_Pos                  11                                             /**< (PIO_IFSCSR) Glitch or Debouncing Filter Selection Status Position */
#define PIO_IFSCSR_P11_Msk                  (_U_(0x1) << PIO_IFSCSR_P11_Pos)               /**< (PIO_IFSCSR) Glitch or Debouncing Filter Selection Status Mask */
#define PIO_IFSCSR_P11                      PIO_IFSCSR_P11_Msk                             /**< \deprecated Old style mask definition for 1 bit bitfield. Use PIO_IFSCSR_P11_Msk instead */
#define PIO_IFSCSR_P12_Pos                  12                                             /**< (PIO_IFSCSR) Glitch or Debouncing Filter Selection Status Position */
#define PIO_IFSCSR_P12_Msk                  (_U_(0x1) << PIO_IFSCSR_P12_Pos)               /**< (PIO_IFSCSR) Glitch or Debouncing Filter Selection Status Mask */
#define PIO_IFSCSR_P12                      PIO_IFSCSR_P12_Msk                             /**< \deprecated Old style mask definition for 1 bit bitfield. Use PIO_IFSCSR_P12_Msk instead */
#define PIO_IFSCSR_P13_Pos                  13                                             /**< (PIO_IFSCSR) Glitch or Debouncing Filter Selection Status Position */
#define PIO_IFSCSR_P13_Msk                  (_U_(0x1) << PIO_IFSCSR_P13_Pos)               /**< (PIO_IFSCSR) Glitch or Debouncing Filter Selection Status Mask */
#define PIO_IFSCSR_P13                      PIO_IFSCSR_P13_Msk                             /**< \deprecated Old style mask definition for 1 bit bitfield. Use PIO_IFSCSR_P13_Msk instead */
#define PIO_IFSCSR_P14_Pos                  14                                             /**< (PIO_IFSCSR) Glitch or Debouncing Filter Selection Status Position */
#define PIO_IFSCSR_P14_Msk                  (_U_(0x1) << PIO_IFSCSR_P14_Pos)               /**< (PIO_IFSCSR) Glitch or Debouncing Filter Selection Status Mask */
#define PIO_IFSCSR_P14                      PIO_IFSCSR_P14_Msk                             /**< \deprecated Old style mask definition for 1 bit bitfield. Use PIO_IFSCSR_P14_Msk instead */
#define PIO_IFSCSR_P15_Pos                  15                                             /**< (PIO_IFSCSR) Glitch or Debouncing Filter Selection Status Position */
#define PIO_IFSCSR_P15_Msk                  (_U_(0x1) << PIO_IFSCSR_P15_Pos)               /**< (PIO_IFSCSR) Glitch or Debouncing Filter Selection Status Mask */
#define PIO_IFSCSR_P15                      PIO_IFSCSR_P15_Msk                             /**< \deprecated Old style mask definition for 1 bit bitfield. Use PIO_IFSCSR_P15_Msk instead */
#define PIO_IFSCSR_P16_Pos                  16                                             /**< (PIO_IFSCSR) Glitch or Debouncing Filter Selection Status Position */
#define PIO_IFSCSR_P16_Msk                  (_U_(0x1) << PIO_IFSCSR_P16_Pos)               /**< (PIO_IFSCSR) Glitch or Debouncing Filter Selection Status Mask */
#define PIO_IFSCSR_P16                      PIO_IFSCSR_P16_Msk                             /**< \deprecated Old style mask definition for 1 bit bitfield. Use PIO_IFSCSR_P16_Msk instead */
#define PIO_IFSCSR_P17_Pos                  17                                             /**< (PIO_IFSCSR) Glitch or Debouncing Filter Selection Status Position */
#define PIO_IFSCSR_P17_Msk                  (_U_(0x1) << PIO_IFSCSR_P17_Pos)               /**< (PIO_IFSCSR) Glitch or Debouncing Filter Selection Status Mask */
#define PIO_IFSCSR_P17                      PIO_IFSCSR_P17_Msk                             /**< \deprecated Old style mask definition for 1 bit bitfield. Use PIO_IFSCSR_P17_Msk instead */
#define PIO_IFSCSR_P18_Pos                  18                                             /**< (PIO_IFSCSR) Glitch or Debouncing Filter Selection Status Position */
#define PIO_IFSCSR_P18_Msk                  (_U_(0x1) << PIO_IFSCSR_P18_Pos)               /**< (PIO_IFSCSR) Glitch or Debouncing Filter Selection Status Mask */
#define PIO_IFSCSR_P18                      PIO_IFSCSR_P18_Msk                             /**< \deprecated Old style mask definition for 1 bit bitfield. Use PIO_IFSCSR_P18_Msk instead */
#define PIO_IFSCSR_P19_Pos                  19                                             /**< (PIO_IFSCSR) Glitch or Debouncing Filter Selection Status Position */
#define PIO_IFSCSR_P19_Msk                  (_U_(0x1) << PIO_IFSCSR_P19_Pos)               /**< (PIO_IFSCSR) Glitch or Debouncing Filter Selection Status Mask */
#define PIO_IFSCSR_P19                      PIO_IFSCSR_P19_Msk                             /**< \deprecated Old style mask definition for 1 bit bitfield. Use PIO_IFSCSR_P19_Msk instead */
#define PIO_IFSCSR_P20_Pos                  20                                             /**< (PIO_IFSCSR) Glitch or Debouncing Filter Selection Status Position */
#define PIO_IFSCSR_P20_Msk                  (_U_(0x1) << PIO_IFSCSR_P20_Pos)               /**< (PIO_IFSCSR) Glitch or Debouncing Filter Selection Status Mask */
#define PIO_IFSCSR_P20                      PIO_IFSCSR_P20_Msk                             /**< \deprecated Old style mask definition for 1 bit bitfield. Use PIO_IFSCSR_P20_Msk instead */
#define PIO_IFSCSR_P21_Pos                  21                                             /**< (PIO_IFSCSR) Glitch or Debouncing Filter Selection Status Position */
#define PIO_IFSCSR_P21_Msk                  (_U_(0x1) << PIO_IFSCSR_P21_Pos)               /**< (PIO_IFSCSR) Glitch or Debouncing Filter Selection Status Mask */
#define PIO_IFSCSR_P21                      PIO_IFSCSR_P21_Msk                             /**< \deprecated Old style mask definition for 1 bit bitfield. Use PIO_IFSCSR_P21_Msk instead */
#define PIO_IFSCSR_P22_Pos                  22                                             /**< (PIO_IFSCSR) Glitch or Debouncing Filter Selection Status Position */
#define PIO_IFSCSR_P22_Msk                  (_U_(0x1) << PIO_IFSCSR_P22_Pos)               /**< (PIO_IFSCSR) Glitch or Debouncing Filter Selection Status Mask */
#define PIO_IFSCSR_P22                      PIO_IFSCSR_P22_Msk                             /**< \deprecated Old style mask definition for 1 bit bitfield. Use PIO_IFSCSR_P22_Msk instead */
#define PIO_IFSCSR_P23_Pos                  23                                             /**< (PIO_IFSCSR) Glitch or Debouncing Filter Selection Status Position */
#define PIO_IFSCSR_P23_Msk                  (_U_(0x1) << PIO_IFSCSR_P23_Pos)               /**< (PIO_IFSCSR) Glitch or Debouncing Filter Selection Status Mask */
#define PIO_IFSCSR_P23                      PIO_IFSCSR_P23_Msk                             /**< \deprecated Old style mask definition for 1 bit bitfield. Use PIO_IFSCSR_P23_Msk instead */
#define PIO_IFSCSR_P24_Pos                  24                                             /**< (PIO_IFSCSR) Glitch or Debouncing Filter Selection Status Position */
#define PIO_IFSCSR_P24_Msk                  (_U_(0x1) << PIO_IFSCSR_P24_Pos)               /**< (PIO_IFSCSR) Glitch or Debouncing Filter Selection Status Mask */
#define PIO_IFSCSR_P24                      PIO_IFSCSR_P24_Msk                             /**< \deprecated Old style mask definition for 1 bit bitfield. Use PIO_IFSCSR_P24_Msk instead */
#define PIO_IFSCSR_P25_Pos                  25                                             /**< (PIO_IFSCSR) Glitch or Debouncing Filter Selection Status Position */
#define PIO_IFSCSR_P25_Msk                  (_U_(0x1) << PIO_IFSCSR_P25_Pos)               /**< (PIO_IFSCSR) Glitch or Debouncing Filter Selection Status Mask */
#define PIO_IFSCSR_P25                      PIO_IFSCSR_P25_Msk                             /**< \deprecated Old style mask definition for 1 bit bitfield. Use PIO_IFSCSR_P25_Msk instead */
#define PIO_IFSCSR_P26_Pos                  26                                             /**< (PIO_IFSCSR) Glitch or Debouncing Filter Selection Status Position */
#define PIO_IFSCSR_P26_Msk                  (_U_(0x1) << PIO_IFSCSR_P26_Pos)               /**< (PIO_IFSCSR) Glitch or Debouncing Filter Selection Status Mask */
#define PIO_IFSCSR_P26                      PIO_IFSCSR_P26_Msk                             /**< \deprecated Old style mask definition for 1 bit bitfield. Use PIO_IFSCSR_P26_Msk instead */
#define PIO_IFSCSR_P27_Pos                  27                                             /**< (PIO_IFSCSR) Glitch or Debouncing Filter Selection Status Position */
#define PIO_IFSCSR_P27_Msk                  (_U_(0x1) << PIO_IFSCSR_P27_Pos)               /**< (PIO_IFSCSR) Glitch or Debouncing Filter Selection Status Mask */
#define PIO_IFSCSR_P27                      PIO_IFSCSR_P27_Msk                             /**< \deprecated Old style mask definition for 1 bit bitfield. Use PIO_IFSCSR_P27_Msk instead */
#define PIO_IFSCSR_P28_Pos                  28                                             /**< (PIO_IFSCSR) Glitch or Debouncing Filter Selection Status Position */
#define PIO_IFSCSR_P28_Msk                  (_U_(0x1) << PIO_IFSCSR_P28_Pos)               /**< (PIO_IFSCSR) Glitch or Debouncing Filter Selection Status Mask */
#define PIO_IFSCSR_P28                      PIO_IFSCSR_P28_Msk                             /**< \deprecated Old style mask definition for 1 bit bitfield. Use PIO_IFSCSR_P28_Msk instead */
#define PIO_IFSCSR_P29_Pos                  29                                             /**< (PIO_IFSCSR) Glitch or Debouncing Filter Selection Status Position */
#define PIO_IFSCSR_P29_Msk                  (_U_(0x1) << PIO_IFSCSR_P29_Pos)               /**< (PIO_IFSCSR) Glitch or Debouncing Filter Selection Status Mask */
#define PIO_IFSCSR_P29                      PIO_IFSCSR_P29_Msk                             /**< \deprecated Old style mask definition for 1 bit bitfield. Use PIO_IFSCSR_P29_Msk instead */
#define PIO_IFSCSR_P30_Pos                  30                                             /**< (PIO_IFSCSR) Glitch or Debouncing Filter Selection Status Position */
#define PIO_IFSCSR_P30_Msk                  (_U_(0x1) << PIO_IFSCSR_P30_Pos)               /**< (PIO_IFSCSR) Glitch or Debouncing Filter Selection Status Mask */
#define PIO_IFSCSR_P30                      PIO_IFSCSR_P30_Msk                             /**< \deprecated Old style mask definition for 1 bit bitfield. Use PIO_IFSCSR_P30_Msk instead */
#define PIO_IFSCSR_P31_Pos                  31                                             /**< (PIO_IFSCSR) Glitch or Debouncing Filter Selection Status Position */
#define PIO_IFSCSR_P31_Msk                  (_U_(0x1) << PIO_IFSCSR_P31_Pos)               /**< (PIO_IFSCSR) Glitch or Debouncing Filter Selection Status Mask */
#define PIO_IFSCSR_P31                      PIO_IFSCSR_P31_Msk                             /**< \deprecated Old style mask definition for 1 bit bitfield. Use PIO_IFSCSR_P31_Msk instead */
#define PIO_IFSCSR_MASK                     _U_(0xFFFFFFFF)                                /**< \deprecated (PIO_IFSCSR) Register MASK  (Use PIO_IFSCSR_Msk instead)  */
#define PIO_IFSCSR_Msk                      _U_(0xFFFFFFFF)                                /**< (PIO_IFSCSR) Register Mask  */

#define PIO_IFSCSR_P_Pos                    0                                              /**< (PIO_IFSCSR Position) Glitch or Debouncing Filter Selection Status */
#define PIO_IFSCSR_P_Msk                    (_U_(0xFFFFFFFF) << PIO_IFSCSR_P_Pos)          /**< (PIO_IFSCSR Mask) P */
#define PIO_IFSCSR_P(value)                 (PIO_IFSCSR_P_Msk & ((value) << PIO_IFSCSR_P_Pos))  

/* -------- PIO_SCDR : (PIO Offset: 0x8c) (R/W 32) Slow Clock Divider Debouncing Register -------- */
#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
#if COMPONENT_TYPEDEF_STYLE == 'N'
typedef union { 
  struct {
    uint32_t DIV:14;                    /**< bit:  0..13  Slow Clock Divider Selection for Debouncing */
    uint32_t :18;                       /**< bit: 14..31  Reserved */
  } bit;                                /**< Structure used for bit  access */
  uint32_t reg;                         /**< Type used for register access */
} PIO_SCDR_Type;
#endif
#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */

#define PIO_SCDR_OFFSET                     (0x8C)                                        /**<  (PIO_SCDR) Slow Clock Divider Debouncing Register  Offset */

#define PIO_SCDR_DIV_Pos                    0                                              /**< (PIO_SCDR) Slow Clock Divider Selection for Debouncing Position */
#define PIO_SCDR_DIV_Msk                    (_U_(0x3FFF) << PIO_SCDR_DIV_Pos)              /**< (PIO_SCDR) Slow Clock Divider Selection for Debouncing Mask */
#define PIO_SCDR_DIV(value)                 (PIO_SCDR_DIV_Msk & ((value) << PIO_SCDR_DIV_Pos))
#define PIO_SCDR_MASK                       _U_(0x3FFF)                                    /**< \deprecated (PIO_SCDR) Register MASK  (Use PIO_SCDR_Msk instead)  */
#define PIO_SCDR_Msk                        _U_(0x3FFF)                                    /**< (PIO_SCDR) Register Mask  */


