Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMV71_DFP/2.4.171/samv71b/include/component/pio.h
#define PIO_OWSR_P0_Pos                     0                                              /**< (PIO_OWSR) Output Write Status Position */
#define PIO_OWSR_P0_Msk                     (_U_(0x1) << PIO_OWSR_P0_Pos)                  /**< (PIO_OWSR) Output Write Status Mask */
#define PIO_OWSR_P0                         PIO_OWSR_P0_Msk                                /**< \deprecated Old style mask definition for 1 bit bitfield. Use PIO_OWSR_P0_Msk instead */
#define PIO_OWSR_P1_Pos                     1                                              /**< (PIO_OWSR) Output Write Status Position */
#define PIO_OWSR_P1_Msk                     (_U_(0x1) << PIO_OWSR_P1_Pos)                  /**< (PIO_OWSR) Output Write Status Mask */
#define PIO_OWSR_P1                         PIO_OWSR_P1_Msk                                /**< \deprecated Old style mask definition for 1 bit bitfield. Use PIO_OWSR_P1_Msk instead */
#define PIO_OWSR_P2_Pos                     2                                              /**< (PIO_OWSR) Output Write Status Position */
#define PIO_OWSR_P2_Msk                     (_U_(0x1) << PIO_OWSR_P2_Pos)                  /**< (PIO_OWSR) Output Write Status Mask */
#define PIO_OWSR_P2                         PIO_OWSR_P2_Msk                                /**< \deprecated Old style mask definition for 1 bit bitfield. Use PIO_OWSR_P2_Msk instead */
#define PIO_OWSR_P3_Pos                     3                                              /**< (PIO_OWSR) Output Write Status Position */
#define PIO_OWSR_P3_Msk                     (_U_(0x1) << PIO_OWSR_P3_Pos)                  /**< (PIO_OWSR) Output Write Status Mask */
#define PIO_OWSR_P3                         PIO_OWSR_P3_Msk                                /**< \deprecated Old style mask definition for 1 bit bitfield. Use PIO_OWSR_P3_Msk instead */
#define PIO_OWSR_P4_Pos                     4                                              /**< (PIO_OWSR) Output Write Status Position */
#define PIO_OWSR_P4_Msk                     (_U_(0x1) << PIO_OWSR_P4_Pos)                  /**< (PIO_OWSR) Output Write Status Mask */
#define PIO_OWSR_P4                         PIO_OWSR_P4_Msk                                /**< \deprecated Old style mask definition for 1 bit bitfield. Use PIO_OWSR_P4_Msk instead */
#define PIO_OWSR_P5_Pos                     5                                              /**< (PIO_OWSR) Output Write Status Position */
#define PIO_OWSR_P5_Msk                     (_U_(0x1) << PIO_OWSR_P5_Pos)                  /**< (PIO_OWSR) Output Write Status Mask */
#define PIO_OWSR_P5                         PIO_OWSR_P5_Msk                                /**< \deprecated Old style mask definition for 1 bit bitfield. Use PIO_OWSR_P5_Msk instead */
#define PIO_OWSR_P6_Pos                     6                                              /**< (PIO_OWSR) Output Write Status Position */
#define PIO_OWSR_P6_Msk                     (_U_(0x1) << PIO_OWSR_P6_Pos)                  /**< (PIO_OWSR) Output Write Status Mask */
#define PIO_OWSR_P6                         PIO_OWSR_P6_Msk                                /**< \deprecated Old style mask definition for 1 bit bitfield. Use PIO_OWSR_P6_Msk instead */
#define PIO_OWSR_P7_Pos                     7                                              /**< (PIO_OWSR) Output Write Status Position */
#define PIO_OWSR_P7_Msk                     (_U_(0x1) << PIO_OWSR_P7_Pos)                  /**< (PIO_OWSR) Output Write Status Mask */
#define PIO_OWSR_P7                         PIO_OWSR_P7_Msk                                /**< \deprecated Old style mask definition for 1 bit bitfield. Use PIO_OWSR_P7_Msk instead */
#define PIO_OWSR_P8_Pos                     8                                              /**< (PIO_OWSR) Output Write Status Position */
#define PIO_OWSR_P8_Msk                     (_U_(0x1) << PIO_OWSR_P8_Pos)                  /**< (PIO_OWSR) Output Write Status Mask */
#define PIO_OWSR_P8                         PIO_OWSR_P8_Msk                                /**< \deprecated Old style mask definition for 1 bit bitfield. Use PIO_OWSR_P8_Msk instead */
#define PIO_OWSR_P9_Pos                     9                                              /**< (PIO_OWSR) Output Write Status Position */
#define PIO_OWSR_P9_Msk                     (_U_(0x1) << PIO_OWSR_P9_Pos)                  /**< (PIO_OWSR) Output Write Status Mask */
#define PIO_OWSR_P9                         PIO_OWSR_P9_Msk                                /**< \deprecated Old style mask definition for 1 bit bitfield. Use PIO_OWSR_P9_Msk instead */
#define PIO_OWSR_P10_Pos                    10                                             /**< (PIO_OWSR) Output Write Status Position */
#define PIO_OWSR_P10_Msk                    (_U_(0x1) << PIO_OWSR_P10_Pos)                 /**< (PIO_OWSR) Output Write Status Mask */
#define PIO_OWSR_P10                        PIO_OWSR_P10_Msk                               /**< \deprecated Old style mask definition for 1 bit bitfield. Use PIO_OWSR_P10_Msk instead */
#define PIO_OWSR_P11_Pos                    11                                             /**< (PIO_OWSR) Output Write Status Position */
#define PIO_OWSR_P11_Msk                    (_U_(0x1) << PIO_OWSR_P11_Pos)                 /**< (PIO_OWSR) Output Write Status Mask */
#define PIO_OWSR_P11                        PIO_OWSR_P11_Msk                               /**< \deprecated Old style mask definition for 1 bit bitfield. Use PIO_OWSR_P11_Msk instead */
#define PIO_OWSR_P12_Pos                    12                                             /**< (PIO_OWSR) Output Write Status Position */
#define PIO_OWSR_P12_Msk                    (_U_(0x1) << PIO_OWSR_P12_Pos)                 /**< (PIO_OWSR) Output Write Status Mask */
#define PIO_OWSR_P12                        PIO_OWSR_P12_Msk                               /**< \deprecated Old style mask definition for 1 bit bitfield. Use PIO_OWSR_P12_Msk instead */
#define PIO_OWSR_P13_Pos                    13                                             /**< (PIO_OWSR) Output Write Status Position */
#define PIO_OWSR_P13_Msk                    (_U_(0x1) << PIO_OWSR_P13_Pos)                 /**< (PIO_OWSR) Output Write Status Mask */
#define PIO_OWSR_P13                        PIO_OWSR_P13_Msk                               /**< \deprecated Old style mask definition for 1 bit bitfield. Use PIO_OWSR_P13_Msk instead */
#define PIO_OWSR_P14_Pos                    14                                             /**< (PIO_OWSR) Output Write Status Position */
#define PIO_OWSR_P14_Msk                    (_U_(0x1) << PIO_OWSR_P14_Pos)                 /**< (PIO_OWSR) Output Write Status Mask */
#define PIO_OWSR_P14                        PIO_OWSR_P14_Msk                               /**< \deprecated Old style mask definition for 1 bit bitfield. Use PIO_OWSR_P14_Msk instead */
#define PIO_OWSR_P15_Pos                    15                                             /**< (PIO_OWSR) Output Write Status Position */
#define PIO_OWSR_P15_Msk                    (_U_(0x1) << PIO_OWSR_P15_Pos)                 /**< (PIO_OWSR) Output Write Status Mask */
#define PIO_OWSR_P15                        PIO_OWSR_P15_Msk                               /**< \deprecated Old style mask definition for 1 bit bitfield. Use PIO_OWSR_P15_Msk instead */
#define PIO_OWSR_P16_Pos                    16                                             /**< (PIO_OWSR) Output Write Status Position */
#define PIO_OWSR_P16_Msk                    (_U_(0x1) << PIO_OWSR_P16_Pos)                 /**< (PIO_OWSR) Output Write Status Mask */
#define PIO_OWSR_P16                        PIO_OWSR_P16_Msk                               /**< \deprecated Old style mask definition for 1 bit bitfield. Use PIO_OWSR_P16_Msk instead */
#define PIO_OWSR_P17_Pos                    17                                             /**< (PIO_OWSR) Output Write Status Position */
#define PIO_OWSR_P17_Msk                    (_U_(0x1) << PIO_OWSR_P17_Pos)                 /**< (PIO_OWSR) Output Write Status Mask */
#define PIO_OWSR_P17                        PIO_OWSR_P17_Msk                               /**< \deprecated Old style mask definition for 1 bit bitfield. Use PIO_OWSR_P17_Msk instead */
#define PIO_OWSR_P18_Pos                    18                                             /**< (PIO_OWSR) Output Write Status Position */
#define PIO_OWSR_P18_Msk                    (_U_(0x1) << PIO_OWSR_P18_Pos)                 /**< (PIO_OWSR) Output Write Status Mask */
#define PIO_OWSR_P18                        PIO_OWSR_P18_Msk                               /**< \deprecated Old style mask definition for 1 bit bitfield. Use PIO_OWSR_P18_Msk instead */
#define PIO_OWSR_P19_Pos                    19                                             /**< (PIO_OWSR) Output Write Status Position */
#define PIO_OWSR_P19_Msk                    (_U_(0x1) << PIO_OWSR_P19_Pos)                 /**< (PIO_OWSR) Output Write Status Mask */
#define PIO_OWSR_P19                        PIO_OWSR_P19_Msk                               /**< \deprecated Old style mask definition for 1 bit bitfield. Use PIO_OWSR_P19_Msk instead */
#define PIO_OWSR_P20_Pos                    20                                             /**< (PIO_OWSR) Output Write Status Position */
#define PIO_OWSR_P20_Msk                    (_U_(0x1) << PIO_OWSR_P20_Pos)                 /**< (PIO_OWSR) Output Write Status Mask */
#define PIO_OWSR_P20                        PIO_OWSR_P20_Msk                               /**< \deprecated Old style mask definition for 1 bit bitfield. Use PIO_OWSR_P20_Msk instead */
#define PIO_OWSR_P21_Pos                    21                                             /**< (PIO_OWSR) Output Write Status Position */
#define PIO_OWSR_P21_Msk                    (_U_(0x1) << PIO_OWSR_P21_Pos)                 /**< (PIO_OWSR) Output Write Status Mask */
#define PIO_OWSR_P21                        PIO_OWSR_P21_Msk                               /**< \deprecated Old style mask definition for 1 bit bitfield. Use PIO_OWSR_P21_Msk instead */
#define PIO_OWSR_P22_Pos                    22                                             /**< (PIO_OWSR) Output Write Status Position */
#define PIO_OWSR_P22_Msk                    (_U_(0x1) << PIO_OWSR_P22_Pos)                 /**< (PIO_OWSR) Output Write Status Mask */
#define PIO_OWSR_P22                        PIO_OWSR_P22_Msk                               /**< \deprecated Old style mask definition for 1 bit bitfield. Use PIO_OWSR_P22_Msk instead */
#define PIO_OWSR_P23_Pos                    23                                             /**< (PIO_OWSR) Output Write Status Position */
#define PIO_OWSR_P23_Msk                    (_U_(0x1) << PIO_OWSR_P23_Pos)                 /**< (PIO_OWSR) Output Write Status Mask */
#define PIO_OWSR_P23                        PIO_OWSR_P23_Msk                               /**< \deprecated Old style mask definition for 1 bit bitfield. Use PIO_OWSR_P23_Msk instead */
#define PIO_OWSR_P24_Pos                    24                                             /**< (PIO_OWSR) Output Write Status Position */
#define PIO_OWSR_P24_Msk                    (_U_(0x1) << PIO_OWSR_P24_Pos)                 /**< (PIO_OWSR) Output Write Status Mask */
#define PIO_OWSR_P24                        PIO_OWSR_P24_Msk                               /**< \deprecated Old style mask definition for 1 bit bitfield. Use PIO_OWSR_P24_Msk instead */
#define PIO_OWSR_P25_Pos                    25                                             /**< (PIO_OWSR) Output Write Status Position */
#define PIO_OWSR_P25_Msk                    (_U_(0x1) << PIO_OWSR_P25_Pos)                 /**< (PIO_OWSR) Output Write Status Mask */
#define PIO_OWSR_P25                        PIO_OWSR_P25_Msk                               /**< \deprecated Old style mask definition for 1 bit bitfield. Use PIO_OWSR_P25_Msk instead */
#define PIO_OWSR_P26_Pos                    26                                             /**< (PIO_OWSR) Output Write Status Position */
#define PIO_OWSR_P26_Msk                    (_U_(0x1) << PIO_OWSR_P26_Pos)                 /**< (PIO_OWSR) Output Write Status Mask */
#define PIO_OWSR_P26                        PIO_OWSR_P26_Msk                               /**< \deprecated Old style mask definition for 1 bit bitfield. Use PIO_OWSR_P26_Msk instead */
#define PIO_OWSR_P27_Pos                    27                                             /**< (PIO_OWSR) Output Write Status Position */
#define PIO_OWSR_P27_Msk                    (_U_(0x1) << PIO_OWSR_P27_Pos)                 /**< (PIO_OWSR) Output Write Status Mask */
#define PIO_OWSR_P27                        PIO_OWSR_P27_Msk                               /**< \deprecated Old style mask definition for 1 bit bitfield. Use PIO_OWSR_P27_Msk instead */
#define PIO_OWSR_P28_Pos                    28                                             /**< (PIO_OWSR) Output Write Status Position */
#define PIO_OWSR_P28_Msk                    (_U_(0x1) << PIO_OWSR_P28_Pos)                 /**< (PIO_OWSR) Output Write Status Mask */
#define PIO_OWSR_P28                        PIO_OWSR_P28_Msk                               /**< \deprecated Old style mask definition for 1 bit bitfield. Use PIO_OWSR_P28_Msk instead */
#define PIO_OWSR_P29_Pos                    29                                             /**< (PIO_OWSR) Output Write Status Position */
#define PIO_OWSR_P29_Msk                    (_U_(0x1) << PIO_OWSR_P29_Pos)                 /**< (PIO_OWSR) Output Write Status Mask */
#define PIO_OWSR_P29                        PIO_OWSR_P29_Msk                               /**< \deprecated Old style mask definition for 1 bit bitfield. Use PIO_OWSR_P29_Msk instead */
#define PIO_OWSR_P30_Pos                    30                                             /**< (PIO_OWSR) Output Write Status Position */
#define PIO_OWSR_P30_Msk                    (_U_(0x1) << PIO_OWSR_P30_Pos)                 /**< (PIO_OWSR) Output Write Status Mask */
#define PIO_OWSR_P30                        PIO_OWSR_P30_Msk                               /**< \deprecated Old style mask definition for 1 bit bitfield. Use PIO_OWSR_P30_Msk instead */
#define PIO_OWSR_P31_Pos                    31                                             /**< (PIO_OWSR) Output Write Status Position */
#define PIO_OWSR_P31_Msk                    (_U_(0x1) << PIO_OWSR_P31_Pos)                 /**< (PIO_OWSR) Output Write Status Mask */
#define PIO_OWSR_P31                        PIO_OWSR_P31_Msk                               /**< \deprecated Old style mask definition for 1 bit bitfield. Use PIO_OWSR_P31_Msk instead */
#define PIO_OWSR_MASK                       _U_(0xFFFFFFFF)                                /**< \deprecated (PIO_OWSR) Register MASK  (Use PIO_OWSR_Msk instead)  */
#define PIO_OWSR_Msk                        _U_(0xFFFFFFFF)                                /**< (PIO_OWSR) Register Mask  */

#define PIO_OWSR_P_Pos                      0                                              /**< (PIO_OWSR Position) Output Write Status */
#define PIO_OWSR_P_Msk                      (_U_(0xFFFFFFFF) << PIO_OWSR_P_Pos)            /**< (PIO_OWSR Mask) P */
#define PIO_OWSR_P(value)                   (PIO_OWSR_P_Msk & ((value) << PIO_OWSR_P_Pos))  

/* -------- PIO_AIMER : (PIO Offset: 0xb0) (/W 32) Additional Interrupt Modes Enable Register -------- */
#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
#if COMPONENT_TYPEDEF_STYLE == 'N'
typedef union { 
  struct {
    uint32_t P0:1;                      /**< bit:      0  Additional Interrupt Modes Enable        */
    uint32_t P1:1;                      /**< bit:      1  Additional Interrupt Modes Enable        */
    uint32_t P2:1;                      /**< bit:      2  Additional Interrupt Modes Enable        */
    uint32_t P3:1;                      /**< bit:      3  Additional Interrupt Modes Enable        */
    uint32_t P4:1;                      /**< bit:      4  Additional Interrupt Modes Enable        */
    uint32_t P5:1;                      /**< bit:      5  Additional Interrupt Modes Enable        */
    uint32_t P6:1;                      /**< bit:      6  Additional Interrupt Modes Enable        */
    uint32_t P7:1;                      /**< bit:      7  Additional Interrupt Modes Enable        */
    uint32_t P8:1;                      /**< bit:      8  Additional Interrupt Modes Enable        */
    uint32_t P9:1;                      /**< bit:      9  Additional Interrupt Modes Enable        */
    uint32_t P10:1;                     /**< bit:     10  Additional Interrupt Modes Enable        */
    uint32_t P11:1;                     /**< bit:     11  Additional Interrupt Modes Enable        */
    uint32_t P12:1;                     /**< bit:     12  Additional Interrupt Modes Enable        */
    uint32_t P13:1;                     /**< bit:     13  Additional Interrupt Modes Enable        */
    uint32_t P14:1;                     /**< bit:     14  Additional Interrupt Modes Enable        */
    uint32_t P15:1;                     /**< bit:     15  Additional Interrupt Modes Enable        */
    uint32_t P16:1;                     /**< bit:     16  Additional Interrupt Modes Enable        */
    uint32_t P17:1;                     /**< bit:     17  Additional Interrupt Modes Enable        */
    uint32_t P18:1;                     /**< bit:     18  Additional Interrupt Modes Enable        */
    uint32_t P19:1;                     /**< bit:     19  Additional Interrupt Modes Enable        */
    uint32_t P20:1;                     /**< bit:     20  Additional Interrupt Modes Enable        */
    uint32_t P21:1;                     /**< bit:     21  Additional Interrupt Modes Enable        */
    uint32_t P22:1;                     /**< bit:     22  Additional Interrupt Modes Enable        */
    uint32_t P23:1;                     /**< bit:     23  Additional Interrupt Modes Enable        */
    uint32_t P24:1;                     /**< bit:     24  Additional Interrupt Modes Enable        */
    uint32_t P25:1;                     /**< bit:     25  Additional Interrupt Modes Enable        */
    uint32_t P26:1;                     /**< bit:     26  Additional Interrupt Modes Enable        */
    uint32_t P27:1;                     /**< bit:     27  Additional Interrupt Modes Enable        */
    uint32_t P28:1;                     /**< bit:     28  Additional Interrupt Modes Enable        */
    uint32_t P29:1;                     /**< bit:     29  Additional Interrupt Modes Enable        */
    uint32_t P30:1;                     /**< bit:     30  Additional Interrupt Modes Enable        */
    uint32_t P31:1;                     /**< bit:     31  Additional Interrupt Modes Enable        */
  } bit;                                /**< Structure used for bit  access */
  struct {
    uint32_t P:32;                      /**< bit:  0..31  Additional Interrupt Modes Enable        */
  } vec;                                /**< Structure used for vec  access  */
  uint32_t reg;                         /**< Type used for register access */
} PIO_AIMER_Type;
#endif
#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */

#define PIO_AIMER_OFFSET                    (0xB0)                                        /**<  (PIO_AIMER) Additional Interrupt Modes Enable Register  Offset */

