Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMV71_DFP/2.4.171/samv71b/include/component/pio.h
/* -------- PIO_ESR : (PIO Offset: 0xc0) (/W 32) Edge Select Register -------- */
#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
#if COMPONENT_TYPEDEF_STYLE == 'N'
typedef union { 
  struct {
    uint32_t P0:1;                      /**< bit:      0  Edge Interrupt Selection                 */
    uint32_t P1:1;                      /**< bit:      1  Edge Interrupt Selection                 */
    uint32_t P2:1;                      /**< bit:      2  Edge Interrupt Selection                 */
    uint32_t P3:1;                      /**< bit:      3  Edge Interrupt Selection                 */
    uint32_t P4:1;                      /**< bit:      4  Edge Interrupt Selection                 */
    uint32_t P5:1;                      /**< bit:      5  Edge Interrupt Selection                 */
    uint32_t P6:1;                      /**< bit:      6  Edge Interrupt Selection                 */
    uint32_t P7:1;                      /**< bit:      7  Edge Interrupt Selection                 */
    uint32_t P8:1;                      /**< bit:      8  Edge Interrupt Selection                 */
    uint32_t P9:1;                      /**< bit:      9  Edge Interrupt Selection                 */
    uint32_t P10:1;                     /**< bit:     10  Edge Interrupt Selection                 */
    uint32_t P11:1;                     /**< bit:     11  Edge Interrupt Selection                 */
    uint32_t P12:1;                     /**< bit:     12  Edge Interrupt Selection                 */
    uint32_t P13:1;                     /**< bit:     13  Edge Interrupt Selection                 */
    uint32_t P14:1;                     /**< bit:     14  Edge Interrupt Selection                 */
    uint32_t P15:1;                     /**< bit:     15  Edge Interrupt Selection                 */
    uint32_t P16:1;                     /**< bit:     16  Edge Interrupt Selection                 */
    uint32_t P17:1;                     /**< bit:     17  Edge Interrupt Selection                 */
    uint32_t P18:1;                     /**< bit:     18  Edge Interrupt Selection                 */
    uint32_t P19:1;                     /**< bit:     19  Edge Interrupt Selection                 */
    uint32_t P20:1;                     /**< bit:     20  Edge Interrupt Selection                 */
    uint32_t P21:1;                     /**< bit:     21  Edge Interrupt Selection                 */
    uint32_t P22:1;                     /**< bit:     22  Edge Interrupt Selection                 */
    uint32_t P23:1;                     /**< bit:     23  Edge Interrupt Selection                 */
    uint32_t P24:1;                     /**< bit:     24  Edge Interrupt Selection                 */
    uint32_t P25:1;                     /**< bit:     25  Edge Interrupt Selection                 */
    uint32_t P26:1;                     /**< bit:     26  Edge Interrupt Selection                 */
    uint32_t P27:1;                     /**< bit:     27  Edge Interrupt Selection                 */
    uint32_t P28:1;                     /**< bit:     28  Edge Interrupt Selection                 */
    uint32_t P29:1;                     /**< bit:     29  Edge Interrupt Selection                 */
    uint32_t P30:1;                     /**< bit:     30  Edge Interrupt Selection                 */
    uint32_t P31:1;                     /**< bit:     31  Edge Interrupt Selection                 */
  } bit;                                /**< Structure used for bit  access */
  struct {
    uint32_t P:32;                      /**< bit:  0..31  Edge Interrupt Selection                 */
  } vec;                                /**< Structure used for vec  access  */
  uint32_t reg;                         /**< Type used for register access */
} PIO_ESR_Type;
#endif
#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */

#define PIO_ESR_OFFSET                      (0xC0)                                        /**<  (PIO_ESR) Edge Select Register  Offset */

#define PIO_ESR_P0_Pos                      0                                              /**< (PIO_ESR) Edge Interrupt Selection Position */
#define PIO_ESR_P0_Msk                      (_U_(0x1) << PIO_ESR_P0_Pos)                   /**< (PIO_ESR) Edge Interrupt Selection Mask */
#define PIO_ESR_P0                          PIO_ESR_P0_Msk                                 /**< \deprecated Old style mask definition for 1 bit bitfield. Use PIO_ESR_P0_Msk instead */
#define PIO_ESR_P1_Pos                      1                                              /**< (PIO_ESR) Edge Interrupt Selection Position */
#define PIO_ESR_P1_Msk                      (_U_(0x1) << PIO_ESR_P1_Pos)                   /**< (PIO_ESR) Edge Interrupt Selection Mask */
#define PIO_ESR_P1                          PIO_ESR_P1_Msk                                 /**< \deprecated Old style mask definition for 1 bit bitfield. Use PIO_ESR_P1_Msk instead */
#define PIO_ESR_P2_Pos                      2                                              /**< (PIO_ESR) Edge Interrupt Selection Position */
#define PIO_ESR_P2_Msk                      (_U_(0x1) << PIO_ESR_P2_Pos)                   /**< (PIO_ESR) Edge Interrupt Selection Mask */
#define PIO_ESR_P2                          PIO_ESR_P2_Msk                                 /**< \deprecated Old style mask definition for 1 bit bitfield. Use PIO_ESR_P2_Msk instead */
#define PIO_ESR_P3_Pos                      3                                              /**< (PIO_ESR) Edge Interrupt Selection Position */
#define PIO_ESR_P3_Msk                      (_U_(0x1) << PIO_ESR_P3_Pos)                   /**< (PIO_ESR) Edge Interrupt Selection Mask */
#define PIO_ESR_P3                          PIO_ESR_P3_Msk                                 /**< \deprecated Old style mask definition for 1 bit bitfield. Use PIO_ESR_P3_Msk instead */
#define PIO_ESR_P4_Pos                      4                                              /**< (PIO_ESR) Edge Interrupt Selection Position */
#define PIO_ESR_P4_Msk                      (_U_(0x1) << PIO_ESR_P4_Pos)                   /**< (PIO_ESR) Edge Interrupt Selection Mask */
#define PIO_ESR_P4                          PIO_ESR_P4_Msk                                 /**< \deprecated Old style mask definition for 1 bit bitfield. Use PIO_ESR_P4_Msk instead */
#define PIO_ESR_P5_Pos                      5                                              /**< (PIO_ESR) Edge Interrupt Selection Position */
#define PIO_ESR_P5_Msk                      (_U_(0x1) << PIO_ESR_P5_Pos)                   /**< (PIO_ESR) Edge Interrupt Selection Mask */
#define PIO_ESR_P5                          PIO_ESR_P5_Msk                                 /**< \deprecated Old style mask definition for 1 bit bitfield. Use PIO_ESR_P5_Msk instead */
#define PIO_ESR_P6_Pos                      6                                              /**< (PIO_ESR) Edge Interrupt Selection Position */
#define PIO_ESR_P6_Msk                      (_U_(0x1) << PIO_ESR_P6_Pos)                   /**< (PIO_ESR) Edge Interrupt Selection Mask */
#define PIO_ESR_P6                          PIO_ESR_P6_Msk                                 /**< \deprecated Old style mask definition for 1 bit bitfield. Use PIO_ESR_P6_Msk instead */
#define PIO_ESR_P7_Pos                      7                                              /**< (PIO_ESR) Edge Interrupt Selection Position */
#define PIO_ESR_P7_Msk                      (_U_(0x1) << PIO_ESR_P7_Pos)                   /**< (PIO_ESR) Edge Interrupt Selection Mask */
#define PIO_ESR_P7                          PIO_ESR_P7_Msk                                 /**< \deprecated Old style mask definition for 1 bit bitfield. Use PIO_ESR_P7_Msk instead */
#define PIO_ESR_P8_Pos                      8                                              /**< (PIO_ESR) Edge Interrupt Selection Position */
#define PIO_ESR_P8_Msk                      (_U_(0x1) << PIO_ESR_P8_Pos)                   /**< (PIO_ESR) Edge Interrupt Selection Mask */
#define PIO_ESR_P8                          PIO_ESR_P8_Msk                                 /**< \deprecated Old style mask definition for 1 bit bitfield. Use PIO_ESR_P8_Msk instead */
#define PIO_ESR_P9_Pos                      9                                              /**< (PIO_ESR) Edge Interrupt Selection Position */
#define PIO_ESR_P9_Msk                      (_U_(0x1) << PIO_ESR_P9_Pos)                   /**< (PIO_ESR) Edge Interrupt Selection Mask */
#define PIO_ESR_P9                          PIO_ESR_P9_Msk                                 /**< \deprecated Old style mask definition for 1 bit bitfield. Use PIO_ESR_P9_Msk instead */
#define PIO_ESR_P10_Pos                     10                                             /**< (PIO_ESR) Edge Interrupt Selection Position */
#define PIO_ESR_P10_Msk                     (_U_(0x1) << PIO_ESR_P10_Pos)                  /**< (PIO_ESR) Edge Interrupt Selection Mask */
#define PIO_ESR_P10                         PIO_ESR_P10_Msk                                /**< \deprecated Old style mask definition for 1 bit bitfield. Use PIO_ESR_P10_Msk instead */
#define PIO_ESR_P11_Pos                     11                                             /**< (PIO_ESR) Edge Interrupt Selection Position */
#define PIO_ESR_P11_Msk                     (_U_(0x1) << PIO_ESR_P11_Pos)                  /**< (PIO_ESR) Edge Interrupt Selection Mask */
#define PIO_ESR_P11                         PIO_ESR_P11_Msk                                /**< \deprecated Old style mask definition for 1 bit bitfield. Use PIO_ESR_P11_Msk instead */
#define PIO_ESR_P12_Pos                     12                                             /**< (PIO_ESR) Edge Interrupt Selection Position */
#define PIO_ESR_P12_Msk                     (_U_(0x1) << PIO_ESR_P12_Pos)                  /**< (PIO_ESR) Edge Interrupt Selection Mask */
#define PIO_ESR_P12                         PIO_ESR_P12_Msk                                /**< \deprecated Old style mask definition for 1 bit bitfield. Use PIO_ESR_P12_Msk instead */
#define PIO_ESR_P13_Pos                     13                                             /**< (PIO_ESR) Edge Interrupt Selection Position */
#define PIO_ESR_P13_Msk                     (_U_(0x1) << PIO_ESR_P13_Pos)                  /**< (PIO_ESR) Edge Interrupt Selection Mask */
#define PIO_ESR_P13                         PIO_ESR_P13_Msk                                /**< \deprecated Old style mask definition for 1 bit bitfield. Use PIO_ESR_P13_Msk instead */
#define PIO_ESR_P14_Pos                     14                                             /**< (PIO_ESR) Edge Interrupt Selection Position */
#define PIO_ESR_P14_Msk                     (_U_(0x1) << PIO_ESR_P14_Pos)                  /**< (PIO_ESR) Edge Interrupt Selection Mask */
#define PIO_ESR_P14                         PIO_ESR_P14_Msk                                /**< \deprecated Old style mask definition for 1 bit bitfield. Use PIO_ESR_P14_Msk instead */
#define PIO_ESR_P15_Pos                     15                                             /**< (PIO_ESR) Edge Interrupt Selection Position */
#define PIO_ESR_P15_Msk                     (_U_(0x1) << PIO_ESR_P15_Pos)                  /**< (PIO_ESR) Edge Interrupt Selection Mask */
#define PIO_ESR_P15                         PIO_ESR_P15_Msk                                /**< \deprecated Old style mask definition for 1 bit bitfield. Use PIO_ESR_P15_Msk instead */
#define PIO_ESR_P16_Pos                     16                                             /**< (PIO_ESR) Edge Interrupt Selection Position */
#define PIO_ESR_P16_Msk                     (_U_(0x1) << PIO_ESR_P16_Pos)                  /**< (PIO_ESR) Edge Interrupt Selection Mask */
#define PIO_ESR_P16                         PIO_ESR_P16_Msk                                /**< \deprecated Old style mask definition for 1 bit bitfield. Use PIO_ESR_P16_Msk instead */
#define PIO_ESR_P17_Pos                     17                                             /**< (PIO_ESR) Edge Interrupt Selection Position */
#define PIO_ESR_P17_Msk                     (_U_(0x1) << PIO_ESR_P17_Pos)                  /**< (PIO_ESR) Edge Interrupt Selection Mask */
#define PIO_ESR_P17                         PIO_ESR_P17_Msk                                /**< \deprecated Old style mask definition for 1 bit bitfield. Use PIO_ESR_P17_Msk instead */
#define PIO_ESR_P18_Pos                     18                                             /**< (PIO_ESR) Edge Interrupt Selection Position */
#define PIO_ESR_P18_Msk                     (_U_(0x1) << PIO_ESR_P18_Pos)                  /**< (PIO_ESR) Edge Interrupt Selection Mask */
#define PIO_ESR_P18                         PIO_ESR_P18_Msk                                /**< \deprecated Old style mask definition for 1 bit bitfield. Use PIO_ESR_P18_Msk instead */
#define PIO_ESR_P19_Pos                     19                                             /**< (PIO_ESR) Edge Interrupt Selection Position */
#define PIO_ESR_P19_Msk                     (_U_(0x1) << PIO_ESR_P19_Pos)                  /**< (PIO_ESR) Edge Interrupt Selection Mask */
#define PIO_ESR_P19                         PIO_ESR_P19_Msk                                /**< \deprecated Old style mask definition for 1 bit bitfield. Use PIO_ESR_P19_Msk instead */
#define PIO_ESR_P20_Pos                     20                                             /**< (PIO_ESR) Edge Interrupt Selection Position */
#define PIO_ESR_P20_Msk                     (_U_(0x1) << PIO_ESR_P20_Pos)                  /**< (PIO_ESR) Edge Interrupt Selection Mask */
#define PIO_ESR_P20                         PIO_ESR_P20_Msk                                /**< \deprecated Old style mask definition for 1 bit bitfield. Use PIO_ESR_P20_Msk instead */
#define PIO_ESR_P21_Pos                     21                                             /**< (PIO_ESR) Edge Interrupt Selection Position */
#define PIO_ESR_P21_Msk                     (_U_(0x1) << PIO_ESR_P21_Pos)                  /**< (PIO_ESR) Edge Interrupt Selection Mask */
#define PIO_ESR_P21                         PIO_ESR_P21_Msk                                /**< \deprecated Old style mask definition for 1 bit bitfield. Use PIO_ESR_P21_Msk instead */
#define PIO_ESR_P22_Pos                     22                                             /**< (PIO_ESR) Edge Interrupt Selection Position */
#define PIO_ESR_P22_Msk                     (_U_(0x1) << PIO_ESR_P22_Pos)                  /**< (PIO_ESR) Edge Interrupt Selection Mask */
#define PIO_ESR_P22                         PIO_ESR_P22_Msk                                /**< \deprecated Old style mask definition for 1 bit bitfield. Use PIO_ESR_P22_Msk instead */
#define PIO_ESR_P23_Pos                     23                                             /**< (PIO_ESR) Edge Interrupt Selection Position */
#define PIO_ESR_P23_Msk                     (_U_(0x1) << PIO_ESR_P23_Pos)                  /**< (PIO_ESR) Edge Interrupt Selection Mask */
#define PIO_ESR_P23                         PIO_ESR_P23_Msk                                /**< \deprecated Old style mask definition for 1 bit bitfield. Use PIO_ESR_P23_Msk instead */
#define PIO_ESR_P24_Pos                     24                                             /**< (PIO_ESR) Edge Interrupt Selection Position */
#define PIO_ESR_P24_Msk                     (_U_(0x1) << PIO_ESR_P24_Pos)                  /**< (PIO_ESR) Edge Interrupt Selection Mask */
#define PIO_ESR_P24                         PIO_ESR_P24_Msk                                /**< \deprecated Old style mask definition for 1 bit bitfield. Use PIO_ESR_P24_Msk instead */
#define PIO_ESR_P25_Pos                     25                                             /**< (PIO_ESR) Edge Interrupt Selection Position */
#define PIO_ESR_P25_Msk                     (_U_(0x1) << PIO_ESR_P25_Pos)                  /**< (PIO_ESR) Edge Interrupt Selection Mask */
#define PIO_ESR_P25                         PIO_ESR_P25_Msk                                /**< \deprecated Old style mask definition for 1 bit bitfield. Use PIO_ESR_P25_Msk instead */
#define PIO_ESR_P26_Pos                     26                                             /**< (PIO_ESR) Edge Interrupt Selection Position */
#define PIO_ESR_P26_Msk                     (_U_(0x1) << PIO_ESR_P26_Pos)                  /**< (PIO_ESR) Edge Interrupt Selection Mask */
#define PIO_ESR_P26                         PIO_ESR_P26_Msk                                /**< \deprecated Old style mask definition for 1 bit bitfield. Use PIO_ESR_P26_Msk instead */
#define PIO_ESR_P27_Pos                     27                                             /**< (PIO_ESR) Edge Interrupt Selection Position */
#define PIO_ESR_P27_Msk                     (_U_(0x1) << PIO_ESR_P27_Pos)                  /**< (PIO_ESR) Edge Interrupt Selection Mask */
#define PIO_ESR_P27                         PIO_ESR_P27_Msk                                /**< \deprecated Old style mask definition for 1 bit bitfield. Use PIO_ESR_P27_Msk instead */
#define PIO_ESR_P28_Pos                     28                                             /**< (PIO_ESR) Edge Interrupt Selection Position */
#define PIO_ESR_P28_Msk                     (_U_(0x1) << PIO_ESR_P28_Pos)                  /**< (PIO_ESR) Edge Interrupt Selection Mask */
#define PIO_ESR_P28                         PIO_ESR_P28_Msk                                /**< \deprecated Old style mask definition for 1 bit bitfield. Use PIO_ESR_P28_Msk instead */
#define PIO_ESR_P29_Pos                     29                                             /**< (PIO_ESR) Edge Interrupt Selection Position */
#define PIO_ESR_P29_Msk                     (_U_(0x1) << PIO_ESR_P29_Pos)                  /**< (PIO_ESR) Edge Interrupt Selection Mask */
#define PIO_ESR_P29                         PIO_ESR_P29_Msk                                /**< \deprecated Old style mask definition for 1 bit bitfield. Use PIO_ESR_P29_Msk instead */
#define PIO_ESR_P30_Pos                     30                                             /**< (PIO_ESR) Edge Interrupt Selection Position */
#define PIO_ESR_P30_Msk                     (_U_(0x1) << PIO_ESR_P30_Pos)                  /**< (PIO_ESR) Edge Interrupt Selection Mask */
#define PIO_ESR_P30                         PIO_ESR_P30_Msk                                /**< \deprecated Old style mask definition for 1 bit bitfield. Use PIO_ESR_P30_Msk instead */
#define PIO_ESR_P31_Pos                     31                                             /**< (PIO_ESR) Edge Interrupt Selection Position */
#define PIO_ESR_P31_Msk                     (_U_(0x1) << PIO_ESR_P31_Pos)                  /**< (PIO_ESR) Edge Interrupt Selection Mask */
#define PIO_ESR_P31                         PIO_ESR_P31_Msk                                /**< \deprecated Old style mask definition for 1 bit bitfield. Use PIO_ESR_P31_Msk instead */
#define PIO_ESR_MASK                        _U_(0xFFFFFFFF)                                /**< \deprecated (PIO_ESR) Register MASK  (Use PIO_ESR_Msk instead)  */
#define PIO_ESR_Msk                         _U_(0xFFFFFFFF)                                /**< (PIO_ESR) Register Mask  */

#define PIO_ESR_P_Pos                       0                                              /**< (PIO_ESR Position) Edge Interrupt Selection */
#define PIO_ESR_P_Msk                       (_U_(0xFFFFFFFF) << PIO_ESR_P_Pos)             /**< (PIO_ESR Mask) P */
#define PIO_ESR_P(value)                    (PIO_ESR_P_Msk & ((value) << PIO_ESR_P_Pos))   

/* -------- PIO_LSR : (PIO Offset: 0xc4) (/W 32) Level Select Register -------- */
#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
#if COMPONENT_TYPEDEF_STYLE == 'N'
typedef union { 
  struct {
    uint32_t P0:1;                      /**< bit:      0  Level Interrupt Selection                */
    uint32_t P1:1;                      /**< bit:      1  Level Interrupt Selection                */
    uint32_t P2:1;                      /**< bit:      2  Level Interrupt Selection                */
    uint32_t P3:1;                      /**< bit:      3  Level Interrupt Selection                */
    uint32_t P4:1;                      /**< bit:      4  Level Interrupt Selection                */
    uint32_t P5:1;                      /**< bit:      5  Level Interrupt Selection                */
    uint32_t P6:1;                      /**< bit:      6  Level Interrupt Selection                */
    uint32_t P7:1;                      /**< bit:      7  Level Interrupt Selection                */
    uint32_t P8:1;                      /**< bit:      8  Level Interrupt Selection                */
    uint32_t P9:1;                      /**< bit:      9  Level Interrupt Selection                */
    uint32_t P10:1;                     /**< bit:     10  Level Interrupt Selection                */
    uint32_t P11:1;                     /**< bit:     11  Level Interrupt Selection                */
    uint32_t P12:1;                     /**< bit:     12  Level Interrupt Selection                */
    uint32_t P13:1;                     /**< bit:     13  Level Interrupt Selection                */
    uint32_t P14:1;                     /**< bit:     14  Level Interrupt Selection                */
    uint32_t P15:1;                     /**< bit:     15  Level Interrupt Selection                */
    uint32_t P16:1;                     /**< bit:     16  Level Interrupt Selection                */
    uint32_t P17:1;                     /**< bit:     17  Level Interrupt Selection                */
    uint32_t P18:1;                     /**< bit:     18  Level Interrupt Selection                */
    uint32_t P19:1;                     /**< bit:     19  Level Interrupt Selection                */
    uint32_t P20:1;                     /**< bit:     20  Level Interrupt Selection                */
    uint32_t P21:1;                     /**< bit:     21  Level Interrupt Selection                */
    uint32_t P22:1;                     /**< bit:     22  Level Interrupt Selection                */
    uint32_t P23:1;                     /**< bit:     23  Level Interrupt Selection                */
    uint32_t P24:1;                     /**< bit:     24  Level Interrupt Selection                */
    uint32_t P25:1;                     /**< bit:     25  Level Interrupt Selection                */
    uint32_t P26:1;                     /**< bit:     26  Level Interrupt Selection                */
    uint32_t P27:1;                     /**< bit:     27  Level Interrupt Selection                */
    uint32_t P28:1;                     /**< bit:     28  Level Interrupt Selection                */
    uint32_t P29:1;                     /**< bit:     29  Level Interrupt Selection                */
    uint32_t P30:1;                     /**< bit:     30  Level Interrupt Selection                */
    uint32_t P31:1;                     /**< bit:     31  Level Interrupt Selection                */
  } bit;                                /**< Structure used for bit  access */
  struct {
    uint32_t P:32;                      /**< bit:  0..31  Level Interrupt Selection                */
  } vec;                                /**< Structure used for vec  access  */
  uint32_t reg;                         /**< Type used for register access */
} PIO_LSR_Type;
#endif
#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */

#define PIO_LSR_OFFSET                      (0xC4)                                        /**<  (PIO_LSR) Level Select Register  Offset */

