Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMV71_DFP/2.4.171/samv71b/include/component/pio.h
#define PIO_SCHMITT_SCHMITT0_Pos            0                                              /**< (PIO_SCHMITT) Schmitt Trigger Control Position */
#define PIO_SCHMITT_SCHMITT0_Msk            (_U_(0x1) << PIO_SCHMITT_SCHMITT0_Pos)         /**< (PIO_SCHMITT) Schmitt Trigger Control Mask */
#define PIO_SCHMITT_SCHMITT0                PIO_SCHMITT_SCHMITT0_Msk                       /**< \deprecated Old style mask definition for 1 bit bitfield. Use PIO_SCHMITT_SCHMITT0_Msk instead */
#define PIO_SCHMITT_SCHMITT1_Pos            1                                              /**< (PIO_SCHMITT) Schmitt Trigger Control Position */
#define PIO_SCHMITT_SCHMITT1_Msk            (_U_(0x1) << PIO_SCHMITT_SCHMITT1_Pos)         /**< (PIO_SCHMITT) Schmitt Trigger Control Mask */
#define PIO_SCHMITT_SCHMITT1                PIO_SCHMITT_SCHMITT1_Msk                       /**< \deprecated Old style mask definition for 1 bit bitfield. Use PIO_SCHMITT_SCHMITT1_Msk instead */
#define PIO_SCHMITT_SCHMITT2_Pos            2                                              /**< (PIO_SCHMITT) Schmitt Trigger Control Position */
#define PIO_SCHMITT_SCHMITT2_Msk            (_U_(0x1) << PIO_SCHMITT_SCHMITT2_Pos)         /**< (PIO_SCHMITT) Schmitt Trigger Control Mask */
#define PIO_SCHMITT_SCHMITT2                PIO_SCHMITT_SCHMITT2_Msk                       /**< \deprecated Old style mask definition for 1 bit bitfield. Use PIO_SCHMITT_SCHMITT2_Msk instead */
#define PIO_SCHMITT_SCHMITT3_Pos            3                                              /**< (PIO_SCHMITT) Schmitt Trigger Control Position */
#define PIO_SCHMITT_SCHMITT3_Msk            (_U_(0x1) << PIO_SCHMITT_SCHMITT3_Pos)         /**< (PIO_SCHMITT) Schmitt Trigger Control Mask */
#define PIO_SCHMITT_SCHMITT3                PIO_SCHMITT_SCHMITT3_Msk                       /**< \deprecated Old style mask definition for 1 bit bitfield. Use PIO_SCHMITT_SCHMITT3_Msk instead */
#define PIO_SCHMITT_SCHMITT4_Pos            4                                              /**< (PIO_SCHMITT) Schmitt Trigger Control Position */
#define PIO_SCHMITT_SCHMITT4_Msk            (_U_(0x1) << PIO_SCHMITT_SCHMITT4_Pos)         /**< (PIO_SCHMITT) Schmitt Trigger Control Mask */
#define PIO_SCHMITT_SCHMITT4                PIO_SCHMITT_SCHMITT4_Msk                       /**< \deprecated Old style mask definition for 1 bit bitfield. Use PIO_SCHMITT_SCHMITT4_Msk instead */
#define PIO_SCHMITT_SCHMITT5_Pos            5                                              /**< (PIO_SCHMITT) Schmitt Trigger Control Position */
#define PIO_SCHMITT_SCHMITT5_Msk            (_U_(0x1) << PIO_SCHMITT_SCHMITT5_Pos)         /**< (PIO_SCHMITT) Schmitt Trigger Control Mask */
#define PIO_SCHMITT_SCHMITT5                PIO_SCHMITT_SCHMITT5_Msk                       /**< \deprecated Old style mask definition for 1 bit bitfield. Use PIO_SCHMITT_SCHMITT5_Msk instead */
#define PIO_SCHMITT_SCHMITT6_Pos            6                                              /**< (PIO_SCHMITT) Schmitt Trigger Control Position */
#define PIO_SCHMITT_SCHMITT6_Msk            (_U_(0x1) << PIO_SCHMITT_SCHMITT6_Pos)         /**< (PIO_SCHMITT) Schmitt Trigger Control Mask */
#define PIO_SCHMITT_SCHMITT6                PIO_SCHMITT_SCHMITT6_Msk                       /**< \deprecated Old style mask definition for 1 bit bitfield. Use PIO_SCHMITT_SCHMITT6_Msk instead */
#define PIO_SCHMITT_SCHMITT7_Pos            7                                              /**< (PIO_SCHMITT) Schmitt Trigger Control Position */
#define PIO_SCHMITT_SCHMITT7_Msk            (_U_(0x1) << PIO_SCHMITT_SCHMITT7_Pos)         /**< (PIO_SCHMITT) Schmitt Trigger Control Mask */
#define PIO_SCHMITT_SCHMITT7                PIO_SCHMITT_SCHMITT7_Msk                       /**< \deprecated Old style mask definition for 1 bit bitfield. Use PIO_SCHMITT_SCHMITT7_Msk instead */
#define PIO_SCHMITT_SCHMITT8_Pos            8                                              /**< (PIO_SCHMITT) Schmitt Trigger Control Position */
#define PIO_SCHMITT_SCHMITT8_Msk            (_U_(0x1) << PIO_SCHMITT_SCHMITT8_Pos)         /**< (PIO_SCHMITT) Schmitt Trigger Control Mask */
#define PIO_SCHMITT_SCHMITT8                PIO_SCHMITT_SCHMITT8_Msk                       /**< \deprecated Old style mask definition for 1 bit bitfield. Use PIO_SCHMITT_SCHMITT8_Msk instead */
#define PIO_SCHMITT_SCHMITT9_Pos            9                                              /**< (PIO_SCHMITT) Schmitt Trigger Control Position */
#define PIO_SCHMITT_SCHMITT9_Msk            (_U_(0x1) << PIO_SCHMITT_SCHMITT9_Pos)         /**< (PIO_SCHMITT) Schmitt Trigger Control Mask */
#define PIO_SCHMITT_SCHMITT9                PIO_SCHMITT_SCHMITT9_Msk                       /**< \deprecated Old style mask definition for 1 bit bitfield. Use PIO_SCHMITT_SCHMITT9_Msk instead */
#define PIO_SCHMITT_SCHMITT10_Pos           10                                             /**< (PIO_SCHMITT) Schmitt Trigger Control Position */
#define PIO_SCHMITT_SCHMITT10_Msk           (_U_(0x1) << PIO_SCHMITT_SCHMITT10_Pos)        /**< (PIO_SCHMITT) Schmitt Trigger Control Mask */
#define PIO_SCHMITT_SCHMITT10               PIO_SCHMITT_SCHMITT10_Msk                      /**< \deprecated Old style mask definition for 1 bit bitfield. Use PIO_SCHMITT_SCHMITT10_Msk instead */
#define PIO_SCHMITT_SCHMITT11_Pos           11                                             /**< (PIO_SCHMITT) Schmitt Trigger Control Position */
#define PIO_SCHMITT_SCHMITT11_Msk           (_U_(0x1) << PIO_SCHMITT_SCHMITT11_Pos)        /**< (PIO_SCHMITT) Schmitt Trigger Control Mask */
#define PIO_SCHMITT_SCHMITT11               PIO_SCHMITT_SCHMITT11_Msk                      /**< \deprecated Old style mask definition for 1 bit bitfield. Use PIO_SCHMITT_SCHMITT11_Msk instead */
#define PIO_SCHMITT_SCHMITT12_Pos           12                                             /**< (PIO_SCHMITT) Schmitt Trigger Control Position */
#define PIO_SCHMITT_SCHMITT12_Msk           (_U_(0x1) << PIO_SCHMITT_SCHMITT12_Pos)        /**< (PIO_SCHMITT) Schmitt Trigger Control Mask */
#define PIO_SCHMITT_SCHMITT12               PIO_SCHMITT_SCHMITT12_Msk                      /**< \deprecated Old style mask definition for 1 bit bitfield. Use PIO_SCHMITT_SCHMITT12_Msk instead */
#define PIO_SCHMITT_SCHMITT13_Pos           13                                             /**< (PIO_SCHMITT) Schmitt Trigger Control Position */
#define PIO_SCHMITT_SCHMITT13_Msk           (_U_(0x1) << PIO_SCHMITT_SCHMITT13_Pos)        /**< (PIO_SCHMITT) Schmitt Trigger Control Mask */
#define PIO_SCHMITT_SCHMITT13               PIO_SCHMITT_SCHMITT13_Msk                      /**< \deprecated Old style mask definition for 1 bit bitfield. Use PIO_SCHMITT_SCHMITT13_Msk instead */
#define PIO_SCHMITT_SCHMITT14_Pos           14                                             /**< (PIO_SCHMITT) Schmitt Trigger Control Position */
#define PIO_SCHMITT_SCHMITT14_Msk           (_U_(0x1) << PIO_SCHMITT_SCHMITT14_Pos)        /**< (PIO_SCHMITT) Schmitt Trigger Control Mask */
#define PIO_SCHMITT_SCHMITT14               PIO_SCHMITT_SCHMITT14_Msk                      /**< \deprecated Old style mask definition for 1 bit bitfield. Use PIO_SCHMITT_SCHMITT14_Msk instead */
#define PIO_SCHMITT_SCHMITT15_Pos           15                                             /**< (PIO_SCHMITT) Schmitt Trigger Control Position */
#define PIO_SCHMITT_SCHMITT15_Msk           (_U_(0x1) << PIO_SCHMITT_SCHMITT15_Pos)        /**< (PIO_SCHMITT) Schmitt Trigger Control Mask */
#define PIO_SCHMITT_SCHMITT15               PIO_SCHMITT_SCHMITT15_Msk                      /**< \deprecated Old style mask definition for 1 bit bitfield. Use PIO_SCHMITT_SCHMITT15_Msk instead */
#define PIO_SCHMITT_SCHMITT16_Pos           16                                             /**< (PIO_SCHMITT) Schmitt Trigger Control Position */
#define PIO_SCHMITT_SCHMITT16_Msk           (_U_(0x1) << PIO_SCHMITT_SCHMITT16_Pos)        /**< (PIO_SCHMITT) Schmitt Trigger Control Mask */
#define PIO_SCHMITT_SCHMITT16               PIO_SCHMITT_SCHMITT16_Msk                      /**< \deprecated Old style mask definition for 1 bit bitfield. Use PIO_SCHMITT_SCHMITT16_Msk instead */
#define PIO_SCHMITT_SCHMITT17_Pos           17                                             /**< (PIO_SCHMITT) Schmitt Trigger Control Position */
#define PIO_SCHMITT_SCHMITT17_Msk           (_U_(0x1) << PIO_SCHMITT_SCHMITT17_Pos)        /**< (PIO_SCHMITT) Schmitt Trigger Control Mask */
#define PIO_SCHMITT_SCHMITT17               PIO_SCHMITT_SCHMITT17_Msk                      /**< \deprecated Old style mask definition for 1 bit bitfield. Use PIO_SCHMITT_SCHMITT17_Msk instead */
#define PIO_SCHMITT_SCHMITT18_Pos           18                                             /**< (PIO_SCHMITT) Schmitt Trigger Control Position */
#define PIO_SCHMITT_SCHMITT18_Msk           (_U_(0x1) << PIO_SCHMITT_SCHMITT18_Pos)        /**< (PIO_SCHMITT) Schmitt Trigger Control Mask */
#define PIO_SCHMITT_SCHMITT18               PIO_SCHMITT_SCHMITT18_Msk                      /**< \deprecated Old style mask definition for 1 bit bitfield. Use PIO_SCHMITT_SCHMITT18_Msk instead */
#define PIO_SCHMITT_SCHMITT19_Pos           19                                             /**< (PIO_SCHMITT) Schmitt Trigger Control Position */
#define PIO_SCHMITT_SCHMITT19_Msk           (_U_(0x1) << PIO_SCHMITT_SCHMITT19_Pos)        /**< (PIO_SCHMITT) Schmitt Trigger Control Mask */
#define PIO_SCHMITT_SCHMITT19               PIO_SCHMITT_SCHMITT19_Msk                      /**< \deprecated Old style mask definition for 1 bit bitfield. Use PIO_SCHMITT_SCHMITT19_Msk instead */
#define PIO_SCHMITT_SCHMITT20_Pos           20                                             /**< (PIO_SCHMITT) Schmitt Trigger Control Position */
#define PIO_SCHMITT_SCHMITT20_Msk           (_U_(0x1) << PIO_SCHMITT_SCHMITT20_Pos)        /**< (PIO_SCHMITT) Schmitt Trigger Control Mask */
#define PIO_SCHMITT_SCHMITT20               PIO_SCHMITT_SCHMITT20_Msk                      /**< \deprecated Old style mask definition for 1 bit bitfield. Use PIO_SCHMITT_SCHMITT20_Msk instead */
#define PIO_SCHMITT_SCHMITT21_Pos           21                                             /**< (PIO_SCHMITT) Schmitt Trigger Control Position */
#define PIO_SCHMITT_SCHMITT21_Msk           (_U_(0x1) << PIO_SCHMITT_SCHMITT21_Pos)        /**< (PIO_SCHMITT) Schmitt Trigger Control Mask */
#define PIO_SCHMITT_SCHMITT21               PIO_SCHMITT_SCHMITT21_Msk                      /**< \deprecated Old style mask definition for 1 bit bitfield. Use PIO_SCHMITT_SCHMITT21_Msk instead */
#define PIO_SCHMITT_SCHMITT22_Pos           22                                             /**< (PIO_SCHMITT) Schmitt Trigger Control Position */
#define PIO_SCHMITT_SCHMITT22_Msk           (_U_(0x1) << PIO_SCHMITT_SCHMITT22_Pos)        /**< (PIO_SCHMITT) Schmitt Trigger Control Mask */
#define PIO_SCHMITT_SCHMITT22               PIO_SCHMITT_SCHMITT22_Msk                      /**< \deprecated Old style mask definition for 1 bit bitfield. Use PIO_SCHMITT_SCHMITT22_Msk instead */
#define PIO_SCHMITT_SCHMITT23_Pos           23                                             /**< (PIO_SCHMITT) Schmitt Trigger Control Position */
#define PIO_SCHMITT_SCHMITT23_Msk           (_U_(0x1) << PIO_SCHMITT_SCHMITT23_Pos)        /**< (PIO_SCHMITT) Schmitt Trigger Control Mask */
#define PIO_SCHMITT_SCHMITT23               PIO_SCHMITT_SCHMITT23_Msk                      /**< \deprecated Old style mask definition for 1 bit bitfield. Use PIO_SCHMITT_SCHMITT23_Msk instead */
#define PIO_SCHMITT_SCHMITT24_Pos           24                                             /**< (PIO_SCHMITT) Schmitt Trigger Control Position */
#define PIO_SCHMITT_SCHMITT24_Msk           (_U_(0x1) << PIO_SCHMITT_SCHMITT24_Pos)        /**< (PIO_SCHMITT) Schmitt Trigger Control Mask */
#define PIO_SCHMITT_SCHMITT24               PIO_SCHMITT_SCHMITT24_Msk                      /**< \deprecated Old style mask definition for 1 bit bitfield. Use PIO_SCHMITT_SCHMITT24_Msk instead */
#define PIO_SCHMITT_SCHMITT25_Pos           25                                             /**< (PIO_SCHMITT) Schmitt Trigger Control Position */
#define PIO_SCHMITT_SCHMITT25_Msk           (_U_(0x1) << PIO_SCHMITT_SCHMITT25_Pos)        /**< (PIO_SCHMITT) Schmitt Trigger Control Mask */
#define PIO_SCHMITT_SCHMITT25               PIO_SCHMITT_SCHMITT25_Msk                      /**< \deprecated Old style mask definition for 1 bit bitfield. Use PIO_SCHMITT_SCHMITT25_Msk instead */
#define PIO_SCHMITT_SCHMITT26_Pos           26                                             /**< (PIO_SCHMITT) Schmitt Trigger Control Position */
#define PIO_SCHMITT_SCHMITT26_Msk           (_U_(0x1) << PIO_SCHMITT_SCHMITT26_Pos)        /**< (PIO_SCHMITT) Schmitt Trigger Control Mask */
#define PIO_SCHMITT_SCHMITT26               PIO_SCHMITT_SCHMITT26_Msk                      /**< \deprecated Old style mask definition for 1 bit bitfield. Use PIO_SCHMITT_SCHMITT26_Msk instead */
#define PIO_SCHMITT_SCHMITT27_Pos           27                                             /**< (PIO_SCHMITT) Schmitt Trigger Control Position */
#define PIO_SCHMITT_SCHMITT27_Msk           (_U_(0x1) << PIO_SCHMITT_SCHMITT27_Pos)        /**< (PIO_SCHMITT) Schmitt Trigger Control Mask */
#define PIO_SCHMITT_SCHMITT27               PIO_SCHMITT_SCHMITT27_Msk                      /**< \deprecated Old style mask definition for 1 bit bitfield. Use PIO_SCHMITT_SCHMITT27_Msk instead */
#define PIO_SCHMITT_SCHMITT28_Pos           28                                             /**< (PIO_SCHMITT) Schmitt Trigger Control Position */
#define PIO_SCHMITT_SCHMITT28_Msk           (_U_(0x1) << PIO_SCHMITT_SCHMITT28_Pos)        /**< (PIO_SCHMITT) Schmitt Trigger Control Mask */
#define PIO_SCHMITT_SCHMITT28               PIO_SCHMITT_SCHMITT28_Msk                      /**< \deprecated Old style mask definition for 1 bit bitfield. Use PIO_SCHMITT_SCHMITT28_Msk instead */
#define PIO_SCHMITT_SCHMITT29_Pos           29                                             /**< (PIO_SCHMITT) Schmitt Trigger Control Position */
#define PIO_SCHMITT_SCHMITT29_Msk           (_U_(0x1) << PIO_SCHMITT_SCHMITT29_Pos)        /**< (PIO_SCHMITT) Schmitt Trigger Control Mask */
#define PIO_SCHMITT_SCHMITT29               PIO_SCHMITT_SCHMITT29_Msk                      /**< \deprecated Old style mask definition for 1 bit bitfield. Use PIO_SCHMITT_SCHMITT29_Msk instead */
#define PIO_SCHMITT_SCHMITT30_Pos           30                                             /**< (PIO_SCHMITT) Schmitt Trigger Control Position */
#define PIO_SCHMITT_SCHMITT30_Msk           (_U_(0x1) << PIO_SCHMITT_SCHMITT30_Pos)        /**< (PIO_SCHMITT) Schmitt Trigger Control Mask */
#define PIO_SCHMITT_SCHMITT30               PIO_SCHMITT_SCHMITT30_Msk                      /**< \deprecated Old style mask definition for 1 bit bitfield. Use PIO_SCHMITT_SCHMITT30_Msk instead */
#define PIO_SCHMITT_SCHMITT31_Pos           31                                             /**< (PIO_SCHMITT) Schmitt Trigger Control Position */
#define PIO_SCHMITT_SCHMITT31_Msk           (_U_(0x1) << PIO_SCHMITT_SCHMITT31_Pos)        /**< (PIO_SCHMITT) Schmitt Trigger Control Mask */
#define PIO_SCHMITT_SCHMITT31               PIO_SCHMITT_SCHMITT31_Msk                      /**< \deprecated Old style mask definition for 1 bit bitfield. Use PIO_SCHMITT_SCHMITT31_Msk instead */
#define PIO_SCHMITT_MASK                    _U_(0xFFFFFFFF)                                /**< \deprecated (PIO_SCHMITT) Register MASK  (Use PIO_SCHMITT_Msk instead)  */
#define PIO_SCHMITT_Msk                     _U_(0xFFFFFFFF)                                /**< (PIO_SCHMITT) Register Mask  */

